analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/afe.svd
<?xml version="1.0" encoding="UTF-8"?>
<device>
  <peripheral>
    <name>afe</name>
    <description>PAN2G5 AFE registers</description>
    <baseAddress>0</baseAddress>
    <size>16</size>
    <registers>
      <register>
        <name>reg1</name>
        <description>reg1</description>
        <addressOffset>0x0001</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>fm_dac_en</name>
            <description>FM DAC Enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>cp_en</name>
            <description>Charge pump enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>vco_en</name>
            <description>VCO enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>lo_buf_en</name>
            <description>LO buffer enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>div_en</name>
            <description>Divider enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>pa_en</name>
            <description>PA enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>tx_sw_en</name>
            <description>TX RF Switch Enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>pll_bias_en</name>
            <description>PLL Bias Enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>reg2</name>
        <description>reg2</description>
        <addressOffset>0x0002</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>clk_dac_en</name>
            <description>DAC clock gating</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>clk_pa_en</name>
            <description>PA clock gating</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>reg3</name>
        <description>reg3</description>
        <addressOffset>0x0003</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>tm_ibout</name>
            <description>selects the analog signal connected to TM_PLL_IB. 
              To measure current the associated EN signal must be low.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>gnd_vco</name>
                <description>GND VCO.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ib_vco</name>
                <description>ib_vco.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ib_cp</name>
                <description>ib_cp.</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ib_fm_mod</name>
                <description>ib_fm_mod.</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ib_lobuf</name>
                <description>ib_lobuf.</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ib_div</name>
                <description>ib_div.</description>
                <value>5</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ib_ref</name>
                <description>ib_ref.</description>
                <value>6</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ib_mon</name>
                <description>ib_mon.</description>
                <value>7</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>tm_vtune_out</name>
            <description>TM VTUNE OUT.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>adc_test_en</name>
            <description>ADC Test Enable.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>clk_data_sel</name>
            <description>CLK_DATA_OUT Source.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>clk_data</name>
                <description>CLK_DATA.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xo_out</name>
                <description>XO_OUT.</description>
                <value>1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>lf_ugb_en</name>
            <description>VCO VTUNE control.Forces VTUNE to VDD/2.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>reg4</name>
        <description>reg4</description>
        <addressOffset>0x0004</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>cp_ofs</name>
            <description>Charge-pump offset current option (Inverse)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>reg5</name>
        <description>reg5</description>
        <addressOffset>0x0005</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>tm_fmdac_out</name>
            <description>Enables FM DAC measurements. Diff on SWADC or single ended on ana_out_vtune.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>reg6</name>
        <description>reg6</description>
        <addressOffset>0x0006</addressOffset>
        <size>8</size>
      </register>
      <register>
        <name>reg7</name>
        <description>reg7</description>
        <addressOffset>0x0007</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>pvtd_trm</name>
            <description>pvtd_trm</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>pvtd_en</name>
            <description>pvtd_en</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>sw_adc_mux</name>
            <description>Mux select for SW_ADC_OUTPUT on RXOUT_D8:0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>sw_adc</name>
                <description>sw_adc.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>adc_flag_i</name>
                <description>adc_flag_i.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>adc_flag_q</name>
                <description>adc_flag_q.</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>tx_fb_out_d</name>
                <description>tx_fb_out_d.</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>pvtd_flag</name>
                <description>pvtd_flag.</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>pvtd_out_d</name>
                <description>pvtd_out_d.</description>
                <value>5</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>reg8</name>
        <description>reg8</description>
        <addressOffset>0x0008</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>d2s_mux</name>
            <description>RX Output Buffer Select.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
             <enumeratedValues>
              <enumeratedValue>
                <name>if_mixer</name>
                <description>if_mixer.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>lpf</name>
                <description>lpf.</description>
                <value>1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>swap_iq</name>
            <description>swap the IQ offset registers, REGA9 and REGA10.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>reg9</name>
        <description>reg9</description>
        <addressOffset>0x0009</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>lna_en</name>
            <description>lna_en.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>mx1_en</name>
            <description>mx1_en RF Mixer</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>mx2_en</name>
            <description>mx2_en IF Mixer</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>lpf_en</name>
            <description>lpf_en.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>clk_adc_en</name>
            <description>clk_adc_en.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>d2s_buf_en</name>
            <description>d2s_buf_en.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>con_sw_rw</name>
            <description>RX_RF Switch EN.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>bias_en</name>
            <description>bias_en.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>reg10</name>
        <description>reg10</description>
        <addressOffset>0x000a</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>lna_hg</name>
            <description>LNA_HG.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>n15_3</name>
                <description>n15_3.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>1_5</name>
                <description>1_5.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>12_7</name>
                <description>12_7.</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>24</name>
                <description>24.</description>
                <value>3</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>mx1_hg</name>
            <description>RF mixer : 12dB</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>mx2_hg</name>
            <description>IF Mixer: 12dB.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>lpf_gain</name>
            <description>lpf_gain.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>0dB</name>
                <description>0dB.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>3dB</name>
                <description>3dB.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>6dB</name>
                <description>6dB.</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>9dB</name>
                <description>9dB.</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>12dB</name>
                <description>12dB.</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>15dB</name>
                <description>15dB.</description>
                <value>5</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>18dB</name>
                <description>18dB.</description>
                <value>6</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>21dB</name>
                <description>21dB.</description>
                <value>7</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>24dB</name>
                <description>24dB.</description>
                <value>8</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>27dB</name>
                <description>27dB.</description>
                <value>9</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>30dB</name>
                <description>30dB.</description>
                <value>10</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>33dB</name>
                <description>33dB.</description>
                <value>11</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>36dB</name>
                <description>36dB.</description>
                <value>12</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>reg11</name>
        <description>reg11</description>
        <addressOffset>0x000b</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>lna_bc</name>
            <description>LNA Tank.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>mx1_bw</name>
            <description>RF Mixer Output Bandwidth.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>dc_dac_en</name>
            <description>dc_dac_en.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>clk_dc_dac</name>
            <description>clk_dc_dac.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>reg12</name>
        <description>reg12</description>
        <addressOffset>0x000c</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>lpf_bw</name>
            <description>LPF filter BW Fine Control.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>0_76_BW</name>
                <description>0_76_BW.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>1_0_BW</name>
                <description>1_0_BW.</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>1_66_BW</name>
                <description>1_66_BW.</description>
                <value>7</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>lpf_mode</name>
            <description>LPF Nominal BW Mode</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>500k</name>
                <description>500 KHz</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>1m</name>
                <description>1 MHz.</description>
                <value>1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>adc_sf</name>
            <description>ADC Sampling Frequency.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>4_8M</name>
                <description>4.8 MHz.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>8M</name>
                <description>8 MHz.</description>
                <value>1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>reg13</name>
        <description>reg13</description>
        <addressOffset>0x000d</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>ib_op</name>
            <description>IB_OP.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>en_swing</name>
            <description>en_swing.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>Hiz</name>
                <description>Hiz.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>pll_tx_vco</name>
                <description>pll_tx_vco.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>pll_lobuf</name>
                <description>pll_lobuf.</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>pll_fm_dac</name>
                <description>pll_fm_dac.</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>lpf_cm</name>
                <description>lpf_cm.</description>
                <value>5</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>vtune</name>
                <description>vtune.</description>
                <value>6</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>vss</name>
                <description>vss.</description>
                <value>7</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>mon_sw</name>
            <description>mon_sw.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>2</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>IQ</name>
                <description>IQ.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sw_adc</name>
                <description>sw_adc.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>fm_cnt</name>
                <description>fm_cnt.</description>
                <value>3</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>sw_adc_en</name>
            <description>sw_adc_en.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>reg14</name>
        <description>reg14</description>
        <addressOffset>0x000e</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>fm_cal_en</name>
            <description>fm_cal_en.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>start_fm_cnt</name>
            <description>start_fm_cnt.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>fm_cnt_addr</name>
            <description>fm_cnt_addr.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>fm_res</name>
            <description>fm_res.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>tm_cp_up</name>
            <description>tm_cp_up.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
