analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/afe.svd
      <register>
        <name>reg15</name>
        <description>reg15</description>
        <addressOffset>0x000f</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>tm_ext_clk</name>
            <description>tm_ext_clk.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>tm_clk_out_sel</name>
            <description>tm_clk_out_sel.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>tclk_src</name>
            <description>tclk_src.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega1</name>
        <description>rega1</description>
        <addressOffset>0x0020</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>frac_en</name>
            <description>frac_en.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>div_frac</name>
            <description>Fractional part of dividing ratio for center frequency (bit [3 .. 0]).
              DivRatio = Freq/2/Fref 2.44G/2/24.0M = 50.8333</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega2</name>
        <description>rega2</description>
        <addressOffset>0x0021</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>div_frac</name>
            <description>Fractional part of dividing ratio for center frequency (bit [11 .. 4]).</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega3</name>
        <description>rega3</description>
        <addressOffset>0x0022</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>div_frac</name>
            <description>Fractional part of dividing ratio for center frequency (bit [14.. 12]).
              Frac(DivRation)*2^15 0.8333*2^15=27306.7 Round to 27307.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>div_int</name>
            <description>Integer part of dividing ratio for center frequency.
              Int(DivRation)-32 50-32=18.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega4</name>
        <description>rega4</description>
        <addressOffset>0x0023</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>sel_hfp</name>
            <description>1: external frequency modulation path input; 0: data is provided by PBRS gen</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>fm_en</name>
                <description>Enable FM Data path.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>fm_dis</name>
                <description>FM Data path is disabled.</description>
                <value>0</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>f_dev</name>
            <description>Frequency deviation calculated by FDEV = Fclk * 2 / 2^15 * (F_DEV+1) for both FSK and PSK mode   (bit [0])</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega5</name>
        <description>rega5</description>
        <addressOffset>0x0024</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>f_dev</name>
            <description>Frequency deviation calculated by FDEV = Fclk * 2 / 2^15 * (F_DEV+1) for both FSK and PSK mode   (bit [8.. 1]).
              p_dev_coef: scaling factor for the fm data path 0 to 1.996.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega6</name>
        <description>rega6</description>
        <addressOffset>0x0025</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>dl_div</name>
            <description>Timing delay setting for low-frequency phase modulation path 0000:  no delay 0001 - 1111:  1 ~ 15 * 1 / Fclk delay.
              LF Phase Mod Delay.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>dl_dac</name>
            <description>Timing delay setting for high-frequency phase modulation path 0000:  no delay 0001 - 1111:  1 ~ 15 * 1 / Fclk delay.
              HF Phase Mod Delay.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega7</name>
        <description>rega7</description>
        <addressOffset>0x0026</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>dl_amp</name>
            <description>Timing delay setting for amplitude modulation path 0000:  no delay 0001 - 1111:  1 ~ 15 * 1 / Fclk delay</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>amp_coef</name>
            <description>Scaling factor in Amp path </description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega8</name>
        <description>rega8</description>
        <addressOffset>0x0027</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>data_clk_en</name>
            <description>1: enable Data clock generator ; 0: disable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>sdma_en</name>
            <description>1: enable Sigma Delta Modulator for amplitude modulation path 0: disable (through)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>sel_amp</name>
            <description>1: external data input 0: data is provided internally</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>internal</name>
                <description>Internatl data pwd.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>external</name>
                <description>external data.</description>
                <value>1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>am_fix</name>
            <description>am_fix</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>amp_coef</name>
                <description>output fixed value to amplitude modulation path defined by AMP_COEF.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>internal</name>
                <description>data is provided internally.</description>
                <value>0</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>fdev_d2</name>
            <description>No AFE Function DBBTop2: 2x FM_DATA</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>2k</name>
                <description>2kHz resolution for high frequency path.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>4k</name>
                <description>4kHz resolution for high frequency path.</description>
                <value>1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>dcocby_en</name>
            <description>Enable Bypassing Digital DC Offset Compensation for AGC path</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>en</name>
                <description>Enable.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>dis</name>
                <description>Disable.</description>
                <value>0</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>ble_24mhz</name>
            <description>Select crystal frequency.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>24m</name>
                <description>Selects 24MHz crystal.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>32m</name>
                <description>Selects 32MHz crystal.</description>
                <value>0</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>inv_fm_pol</name>
            <description>inverts the polarity of the HF FM DATA Path.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>inv</name>
                <description>Infverted from LF Path.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>non_inv</name>
                <description>Same polarity from LF Path.</description>
                <value>0</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>rega9</name>
        <description>rega9 *signed*</description>
        <addressOffset>0x0028</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>dc_i</name>
            <description>2s complement RX-I Offset Trim.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega10</name>
        <description>rega10 *signed*</description>
        <addressOffset>0x0029</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>dc_q</name>
            <description>2s complement RX-Q Offset Trim.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega11</name>
        <description>rega11</description>
        <addressOffset>0x002a</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>ib_div_dac</name>
            <description>Adjusts the resistor connected to the gate in the pll bias generator.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>pll_ib_res</name>
            <description>Adjusts the resistor in the soruce lead of the pll bias generator.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega12</name>
        <description>rega12</description>
        <addressOffset>0x002b</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>ib_vdo_dac</name>
            <description>16u - 47.5u. 0.5u step</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega13</name>
        <description>rega13</description>
        <addressOffset>0x002c</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>ib_cp_dac</name>
            <description>4u - 19.5u. 0.5u step</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega14</name>
        <description>rega14</description>
        <addressOffset>0x002d</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>ib_ref_dac</name>
            <description>0.625u - 10u. 0.5u step</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ib_fm_dac</name>
            <description>5u - 42.5u. 0.5u step</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega15</name>
        <description>rega15</description>
        <addressOffset>0x002e</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>ib_lobuf_dac</name>
            <description>4u - 35.5u. 0.5u step</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rega16</name>
        <description>rega16</description>
        <addressOffset>0x002f</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>ib_mx2_trm</name>
            <description>ib_mx2_trm.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ib_lna_trm</name>
            <description>ib_lna_trm.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>regb1</name>
        <description>regb1</description>
        <addressOffset>0x0030</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>ib_mx1_trm</name>
            <description>ib_mx1_trm.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>ib_mx1_tc</name>
            <description>ib_mx1_tc.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>regb2</name>
        <description>regb2</description>
        <addressOffset>0x0031</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>ana_mux_sel</name>
            <description>selects the signal connected to ana_rffe_out.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>gnd_ana</name>
                <description>GND_ANA.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>tm_rx_ib</name>
                <description>tm_rx_ib.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>tm_pll_ib</name>
                <description>tm_pll_ib.</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>if_cm</name>
                <description>if_cm.</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>lpf_cm</name>
                <description>lpf_cm.</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>vtune_out</name>
                <description>vtune_out.</description>
                <value>5</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>tm_rx_ib_en</name>
            <description>Selects the RX current attached to TM_RX_IB.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>gnd_mx2</name>
                <description>gnd_mx2.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>lna_ib</name>
                <description>lna_ib.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rf_mixer_ib</name>
                <description>rf_mixer_ib.</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>if_mixer_ib</name>
                <description>if_mixer_ib.</description>
                <value>3</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>tm_if_lpf_cmo_sel</name>
            <description>selects source of ADC or ana_out_vtune.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>q</name>
                <description>q.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>i</name>
                <description>i.</description>
                <value>1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>tm_if_lpf_cmo_en</name>
            <description>Enables IF LPF common mode Out on ADC or ana_out_vtune.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>regb3</name>
        <description>regb3</description>
        <addressOffset>0x0032</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>b_osc</name>
            <description>PLL VCO Bank Selection.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>tx_rxb</name>
            <description>Scales current in VCO.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>regb4</name>
        <description>regb4</description>
        <addressOffset>0x0033</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>pa_lsb</name>
            <description>pa_lsb.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>pa_con_dt</name>
            <description>pa_con_dt.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>regb5</name>
        <description>regb5</description>
        <addressOffset>0x0034</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>pa_dt_vcm</name>
            <description>pa_dt_vcm.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>tx_dtcal_en</name>
            <description>tx_dtcal_en.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>regb6</name>
        <description>regb6</description>
        <addressOffset>0x0035</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>pa_cp</name>
            <description>pa_cp.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>adc_sf</name>
            <description>ADC clock rate selection.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>d2</name>
                <description>d2</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>d3</name>
                <description>d3.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>d4</name>
                <description>d4.</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>d6</name>
                <description>d6.</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>d8</name>
                <description>d8.</description>
                <value>4</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>regb7</name>
        <description>regb7</description>
        <addressOffset>0x0036</addressOffset>
        <size>8</size>
        <fields>
          <field>
            <name>vcm1_rx</name>
            <description>Common Mode Control for IF Mixer, LPF, and output buffer.
              350mV - 650mV 45 mV step.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>vcm2_rx</name>
            <description>Common Mode for BB.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
    </registers>
  </peripheral>
</device>
